[
    {
        "ID": 1,
        "Video IDs": [
            21,
            148,
            18,
            178,
            149,
            77,
            273,
            188,
            10,
            59,
            311,
            202,
            193,
            19,
            252,
            104,
            81,
            66,
            327,
            179,
            156,
            150,
            142,
            41,
            209,
            223,
            236,
            49,
            98,
            27
        ],
        "Model Output": [
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially sitting, then standing up and bending over, and finally lying face down on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen, as evidenced by the progression from walking upright to being on the ground in a lying position.",
            "Y\n\nThe person has fallen. In the initial frames, the person is standing and walking around the room. In the later frames, the person is seen losing balance, falling onto the mattress, and then lying on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen as they are no longer seated in the chair and are now on the floor with their hands and knees making contact with the ground.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially sitting on a chair, then bending forward, and subsequently ending up on the floor in a prone position, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen losing balance and ending up on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially sitting on a chair, then gradually leaning forward and eventually ending up on the floor, lying down.",
            "Y\n\nThe person appears to have fallen. In the first two frames, the person is standing. In the third frame, the person is in the process of falling forward. In the fourth frame, the person is lying flat on the ground, indicating a fall.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is seen lying on the mattress on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is standing and walking. In the later frames, the person is seen lying on the mattress on the floor, indicating a fall.",
            "N\n\nThe person has not fallen. They are seen moving a chair, sitting down, and then using the computer. There is no indication of a fall in any of the frames.",
            "N\n\nThe person in the frames appears to be bending down and then standing back up, rather than falling. The sequence shows controlled movements without any indication of a loss of balance or an uncontrolled descent to the ground.",
            "N\n\nThe person has not fallen. In the sequence of images, the individual is seen walking into the room and then bending down, possibly to pick something up or look at something on the lower shelves. There is no indication of a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen losing balance and falling backward onto a mattress on the floor, eventually lying down flat.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is sitting and then standing up. In the later frames, the person is seen losing balance and ultimately lying on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is seen descending the stairs and then moving forward. In the subsequent frames, the person is on the floor, indicating a fall. Finally, the person is seen getting up from the floor.",
            "N\n\nThe person in the frames does not appear to have fallen. They are seen walking around the room, interacting with objects, and maintaining an upright posture throughout the sequence of images. There is no indication of a fall in any of the frames.",
            "N\n\nThe person in the frames appears to be walking around the room without any indication of falling. Their posture remains upright and stable throughout the sequence of images.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are standing upright. In the second frame, they are moving forward. In the third frame, they are leaning forward with their arms extended towards the ground, indicating a loss of balance and a fall.",
            "Y\n\nThe person appears to be falling forward with their arms extended towards the ground, indicating a loss of balance and an impending fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from sitting on a chair to being on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are seated on a chair. In the subsequent frames, they are progressively moving towards the ground, and in the final frames, they are lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen, as evidenced by the last few frames where they are lying on the mattress on the floor, transitioning from an upright position to a horizontal one.",
            "N\n\nThe person in the frames appears to be walking towards a chair, bending down, and then sitting down. There is no indication of a fall; the movements seem controlled and intentional.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing upright to bending over, and then to being on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual losing balance, descending towards the floor, and ultimately lying flat on the ground.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is seen lying on the mattress, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is sitting and then standing up. In the later frames, the person is seen losing balance and eventually lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is sitting on a couch and then stands up. In the subsequent frames, the person appears to lose balance and falls onto a mattress on the floor, eventually lying down completely."
        ],
        "Model Predictions": [
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y"
        ],
        "Ground Truth": [
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y"
        ],
        "True Positive Count": 23,
        "True Negative Count": 6,
        "False Positive Count": 1,
        "False Negative Count": 0,
        "Precision": 0.9680555555555556,
        "Recall": 0.9666666666666667,
        "F1 Score": 0.9657392253136934
    },
    {
        "ID": 2,
        "Video IDs": [
            21,
            54,
            149,
            179,
            240,
            45,
            80,
            206,
            301,
            79,
            169,
            19,
            83,
            177,
            115,
            129,
            203,
            144,
            213,
            311,
            207,
            285,
            52,
            284,
            161,
            209,
            236,
            48,
            111,
            23
        ],
        "Model Output": [
            "Y\n\nThe person appears to have fallen. In the initial frames, the person is sitting and then standing up. In the subsequent frames, the person is seen lying on the floor, indicating a fall.",
            "Y\n\nThe person is seen walking and then lying on the floor in the last few frames, indicating that they have fallen.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated, then appears to lose balance, and is subsequently seen on the floor in a lying position.",
            "Y\n\nThe person appears to have fallen as they are seen moving from an upright position to a position where they are leaning forward with their arms extended towards the ground, indicating a loss of balance and a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially standing and then gradually moves towards the floor, eventually lying flat on the ground.",
            "N\n\nThe person has not fallen. They appear to have intentionally laid down on the mattress placed on the floor. The sequence of movements suggests a deliberate action rather than an accidental fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen descending the stairs and then lying on the floor, indicating a fall.",
            "N\n\nThe person in the frames appears to be bending over or reaching for something rather than falling. There is no indication of a loss of balance or an uncontrolled descent to the ground.",
            "N\n\nThe person in the images is seen walking towards an object on the floor, bending down to pick it up, and then standing back up. There is no indication of a fall in these frames.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen descending the stairs and then losing balance, resulting in a fall to the floor. The person is shown lying on the floor before getting up again.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then loses balance and begins to fall, and finally ends up on the floor.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen losing balance and falling backward onto a mattress on the floor, eventually lying down completely.",
            "Y\n\nThe person is seen descending the stairs and walking towards the center of the room. In the last few frames, the person is lying on the floor, indicating that they have fallen.",
            "Y\n\nThe person appears to have fallen as they are seen transitioning from sitting on a chair to being on their hands and knees on the floor.",
            "N\n\nThe person in the images appears to be moving around the room and then sitting down on the couch. There is no indication of a fall in any of the frames.",
            "N\n\nThe person in the frames is seen moving from the couch to the table and then sitting down. There is no indication of a fall in any of the frames. The movements appear controlled and intentional.",
            "N\n\nThe person appears to be bending down and then standing back up, rather than falling. The sequence of movements does not indicate a loss of balance or an uncontrolled descent to the ground.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is seen lying on the ground, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and walking, but then they are seen sitting on the couch and eventually lying down with their legs up, indicating a fall.",
            "N\n\nThe person in the images appears to be moving a chair, sitting down, and then using a computer. There is no indication of a fall in any of the frames.",
            "N\n\nThe person in the frames appears to be bending down and then standing back up, but there is no indication that they have fallen.",
            "N\n\nThe person in the frames appears to be moving around the room but does not show any signs of falling. They maintain an upright posture throughout the sequence of images.",
            "Y\n\nThe person is lying on the floor in the last few frames, indicating that they have fallen.",
            "N\n\nThe person in the images appears to be standing and moving around the room without any indication of falling. Their posture remains upright and stable throughout the sequence of frames.",
            "N\n\nThe person appears to be bending forward, possibly to pick something up or to perform an action, but there is no indication that they have fallen.",
            "N\n\nThe person in the frames appears to be walking towards a chair, bending down, and then sitting down. There is no indication of a fall; the movements seem controlled and intentional.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual losing balance, descending towards the floor, and ultimately lying flat on the ground.",
            "Y\n\nThe person is lying face down on the mattress in the last few frames, indicating that they have fallen.",
            "N\n\nThe person in the frames is seen moving from the couch to the table and then sitting down. There is no indication of a fall; the movements appear controlled and intentional.",
            "Y\n\nThe person has fallen. In the initial frames, the person is seated on a bench. As the frames progress, the person stands up and then appears to lose balance, ultimately ending up lying on the mattress on the floor."
        ],
        "Model Predictions": [
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y"
        ],
        "Ground Truth": [
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "N",
            "N",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "Y"
        ],
        "True Positive Count": 15,
        "True Negative Count": 11,
        "False Positive Count": 2,
        "False Negative Count": 2,
        "Precision": 0.8666666666666667,
        "Recall": 0.8666666666666667,
        "F1 Score": 0.8666666666666667
    },
    {
        "ID": 3,
        "Video IDs": [
            148,
            276,
            212,
            74,
            139,
            271,
            300,
            50,
            306,
            37,
            122,
            275,
            70,
            175,
            253,
            177,
            13,
            224,
            149,
            242,
            218,
            238,
            138,
            7,
            248,
            267,
            123,
            111,
            320,
            128
        ],
        "Model Output": [
            "Y\n\nThe person has fallen. In the last two frames, the individual is seen lying on the ground, indicating a fall.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially sitting on a chair, then gradually leaning forward, losing balance, and eventually ending up on the floor in a prone position.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is seen walking, then bending down, and eventually ending up on the floor with their legs elevated, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is seen sitting and then standing up. In the subsequent frames, the person appears to lose balance and falls onto the mat on the floor, ending up lying down.",
            "Y\n\nThe person has fallen. In the last frame, they are lying on the floor with their legs and arms in the air, indicating a fall.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially sitting on a chair, then gradually moving towards the floor, and finally lying on the ground, indicating a fall.",
            "N\n\nThe person in the images appears to be intentionally kneeling down and then getting back up, rather than falling. The movements seem controlled and deliberate, indicating that they have not fallen.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is seen lying flat on the floor, indicating a fall.",
            "N\n\nThe person in the frames appears to be bending down to pick something up from the floor. They maintain control and balance throughout the sequence and eventually stand back up, indicating that they have not fallen.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially walking towards a mattress on the floor. In the fourth frame, the person is seen falling backward onto the mattress, and in the subsequent frames, they remain lying face down on the mattress, indicating that they have fallen and are not getting up.",
            "N\n\nThe person in the frames appears to be moving around the room and then sitting down on the couch. There is no indication of a fall; the movements seem controlled and intentional.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then appears to lose balance, and subsequently ends up on the floor, lying down and not making any effort to get up.",
            "N\n\nThe person in the frames is seen sitting, standing, and moving around the room without any indication of falling. They appear to be in control of their movements throughout the sequence.",
            "Y\n\nThe person has fallen. In the first frame, the person is standing upright. In the second frame, the person is bending forward, and in the third frame, the person is on the ground, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is standing and appears to be losing balance. In the subsequent frames, the person is seen descending towards the floor, and in the final frames, the person is lying on the ground, indicating a fall.",
            "Y\n\nThe person has fallen as they are seen transitioning from sitting on a chair to being on their hands and knees on the floor.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially sitting, then standing, and subsequently seen on the floor in a prone position, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to a position on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially sitting on a chair, then bending forward, and subsequently ending up on the floor in a prone position, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are standing. In the second frame, they are crouching down, and in the subsequent frames, they are lying flat on the floor, indicating a fall.",
            "N\n\nThe person appears to be bending down, possibly to pick something up or tie their shoe, but there is no indication that they have fallen.",
            "Y\n\nThe person has fallen. In the initial frames, the person is standing and walking. In the subsequent frames, the person is seen on the floor in a lying position, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are seated on a chair. In the second frame, they are in the process of falling off the chair. In the third and fourth frames, they are lying on the ground, indicating that they have fallen.",
            "Y\n\nThe person appears to have fallen. In the last two frames, the individual is lying on the mattress on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from walking upright to being on the floor in a prone position, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing, then is seen descending towards the floor, and finally lying flat on the ground, indicating a fall.",
            "N\n\nThe person in the series of images appears to be moving around the room and then sitting down on the couch. There is no indication of a fall; the movements seem controlled and intentional.",
            "N\n\nThe person in the frames is seen moving from the couch to the table and then sitting down. There is no indication of a fall; the movements appear controlled and intentional.",
            "N\n\nThe person in the images does not appear to have fallen. They are seen moving a chair, sitting down, and then standing up again without any indication of losing balance or falling.",
            "N\n\nThe person in the images is seen sitting at a table, then standing up, walking around the room, and finally sitting on a couch. There is no indication of a fall in any of the frames."
        ],
        "Model Predictions": [
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "N"
        ],
        "Ground Truth": [
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "N"
        ],
        "True Positive Count": 19,
        "True Negative Count": 9,
        "False Positive Count": 2,
        "False Negative Count": 0,
        "Precision": 0.9396825396825397,
        "Recall": 0.9333333333333333,
        "F1 Score": 0.9316666666666668
    },
    {
        "ID": 4,
        "Video IDs": [
            139,
            166,
            7,
            117,
            83,
            76,
            200,
            298,
            91,
            157,
            126,
            170,
            249,
            4,
            274,
            146,
            188,
            292,
            195,
            271,
            35,
            210,
            231,
            266,
            94,
            214,
            32,
            120,
            172,
            207
        ],
        "Model Output": [
            "Y\n\nThe person has fallen. In the last frame, they are lying on the floor with their legs and arms in the air, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are standing upright. In the second frame, they are in the process of falling, and in the third frame, they are lying on the ground.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is lying on the mattress on the floor, indicating a fall.",
            "N\n\nThe person in the series of images does not appear to have fallen. They are seen sitting on the couch, standing up, walking around the room, and then sitting down at the table without any indication of a fall.",
            "Y\n\nThe person has fallen. In the last three frames, the individual is seen lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sixth frame, the person is seen losing balance and falling backward. In the seventh and eighth frames, the person is lying on the floor, indicating that they have fallen.",
            "N\n\nThe person in the frames appears to be intentionally sitting down and then lying on the couch. There are no indications of a fall; the movements seem controlled and deliberate.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to a crouched position, then to kneeling, and finally to a position on the floor, indicating a loss of balance or control.",
            "Y\n\nThe person has fallen. In the initial frames, the person is seated at the table. As the sequence progresses, the person leans forward, stands up, and then appears to lose balance and fall to the floor, ending up lying down in the last two frames.",
            "Y\n\nThe person appears to have fallen as they are seen moving from a seated position to a position where they are bent over and reaching towards the ground, indicating a loss of balance or control.",
            "N\n\nThe person in the frames is seen moving around the room, sitting on the couch, walking, and then sitting at the table. There is no indication of a fall in any of the frames. The movements appear controlled and deliberate.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are seated on a chair. In the second frame, they are in the process of losing balance and falling. In the third and fourth frames, they are on the ground, indicating that they have indeed fallen.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and then progressively moves towards the ground, ultimately lying flat on the floor.",
            "N\n\nThe person has not fallen. They appear to have intentionally laid down on the mattress placed on the floor. The sequence of movements suggests a deliberate action rather than an accidental fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then leans forward, and eventually ends up lying on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are kneeling. In the second frame, they are leaning forward with their head down. In the third frame, they are lying on the ground, indicating a fall.",
            "Y\n\nThe person appears to have fallen as they are seen in a prone position on the floor in the final frame.",
            "N\n\nThe person appears to be kneeling on the floor in a controlled manner rather than falling. There is no indication of a sudden or uncontrolled movement that would suggest a fall.",
            "N\n\nThe person in the frames is bending down and appears to be picking something up from the floor. There is no indication of a fall; the person maintains balance and an upright posture throughout the sequence.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then appears to lose balance, and subsequently ends up on the floor, lying down.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and then gradually moves towards a sitting position, followed by lying flat on the floor, indicating a fall.",
            "N\n\nThe person in the frames appears to be sitting down on the couch rather than falling. The sequence shows a controlled movement towards the couch, ending in a seated position.",
            "Y\n\nThe person is seen standing and then is shown on the floor in subsequent frames, indicating that they have fallen.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially standing and then progressively moving towards the ground, ultimately lying flat on the floor.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is lying on the floor, indicating a fall.",
            "N\n\nThe person in the images appears to be kneeling or crouching down in the second frame, but they are standing again in the third frame, indicating that they have not fallen.",
            "Y\n\nThe person appears to have fallen. In the initial frames, the person is sitting and then standing up. In the later frames, the person is seen bending forward and then lying on the floor, indicating a fall.",
            "N\n\nThe person in the images does not appear to have fallen. They are seen sitting on the couch, then standing up and walking around the room without any indication of a fall.",
            "N\n\nThe person in the images appears to be bending over, not falling. The position and posture suggest intentional movement rather than an accidental fall.",
            "N\n\nThe person in the frames appears to be bending down and then standing back up, but there is no indication that they have fallen."
        ],
        "Model Predictions": [
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "N"
        ],
        "Ground Truth": [
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N"
        ],
        "True Positive Count": 18,
        "True Negative Count": 9,
        "False Positive Count": 1,
        "False Negative Count": 2,
        "Precision": 0.9043062200956936,
        "Recall": 0.9,
        "F1 Score": 0.9010989010989012
    },
    {
        "ID": 5,
        "Video IDs": [
            268,
            254,
            47,
            323,
            52,
            320,
            30,
            224,
            196,
            286,
            99,
            275,
            186,
            156,
            66,
            185,
            139,
            253,
            326,
            58,
            105,
            159,
            148,
            172,
            175,
            54,
            240,
            56,
            208,
            211
        ],
        "Model Output": [
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and then is seen losing balance, falling to the ground, and remaining on the floor in a prone position.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and then bending over. Subsequently, they are seen on the floor in a prone position, indicating a fall.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is seen lying on the mattress on the floor, indicating a fall.",
            "N\n\nThe person in the images appears to be walking around the room and standing in various positions. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person is seen standing and walking in the earlier frames, but in the later frames, they are lying on the floor in a position that suggests they have fallen.",
            "N\n\nThe person in the images has not fallen. They are seen moving a chair, sitting down, and then standing up again without any indication of losing balance or falling.",
            "Y\n\nThe person appears to have fallen. In the last two frames, they are seen lying on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on all fours and then lying on the ground, indicating a fall.",
            "N\n\nThe person in the frames is walking into the room and bending down to pick something up from the shelf. There is no indication that the person has fallen.",
            "N\n\nThe person in the frames appears to be moving around the room but remains upright in all the images. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person has fallen. In the eighth frame, the individual is seen in mid-fall, and in the subsequent frames, they are lying on the floor, indicating that they have fallen.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially sitting on a chair, then losing balance, and finally ending up lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the first frame, the person is seated on a chair. In the second frame, the person is in the process of falling forward off the chair. In the third frame, the person is lying on the ground, indicating that they have fallen.",
            "Y\n\nThe person appears to have fallen in the third frame, as they are seen in a horizontal position with their arms extended forward, which is indicative of a fall.",
            "N\n\nThe person in the frames does not appear to have fallen. They are seen walking around the room, interacting with objects, and maintaining an upright posture throughout the sequence of images.",
            "Y\n\nThe person has fallen. In the first frame, the person is sitting on a chair. In the second frame, the person is in the process of standing up or moving. In the third frame, the person is lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the last frame, they are lying on the floor with their legs and arms in the air, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is standing and appears to be losing balance. In the subsequent frames, the person is seen descending towards the floor, and finally, they are lying on the ground, indicating a fall.",
            "N\n\nThe person in the frames is walking around the room and appears to be maintaining their balance throughout the sequence. There are no indications of a fall in any of the frames.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen losing balance, falling backward, and ending up lying on the floor.",
            "Y\n\nThe person appears to have fallen in the last three frames, as they are lying on the floor in a prone position.",
            "Y\n\nThe person has fallen. In the first frame, they are standing upright. In the second frame, they are leaning forward significantly, indicating a loss of balance. In the third frame, they are on the ground, confirming the fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially walking, then loses balance, and is seen on the ground in the final frames.",
            "N\n\nThe person in the frames appears to be bending over or moving downward, but there is no clear indication that they have fallen. The person is still in an upright position, and there is no evidence of a fall.",
            "Y\n\nThe person has fallen. In the first frame, the person is standing upright. In the second frame, they are bending forward, and in the third frame, they are on the ground, indicating a fall.",
            "Y\n\nThe person is seen lying on the floor in the last three frames, indicating that they have fallen.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially standing and then progressively moves towards the floor, eventually lying flat on their back, indicating a fall.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is seen lying on the floor, indicating a fall.",
            "N\n\nThe person in the frames appears to be sitting down on the couch rather than falling. The sequence shows a controlled movement towards the couch, ending in a seated position.",
            "N\n\nThe person in the frames appears to be sitting down on the couch rather than falling. The sequence shows a controlled movement towards the couch, ending in a seated position."
        ],
        "Model Predictions": [
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N"
        ],
        "Ground Truth": [
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N"
        ],
        "True Positive Count": 19,
        "True Negative Count": 8,
        "False Positive Count": 2,
        "False Negative Count": 1,
        "Precision": 0.8994708994708994,
        "Recall": 0.9,
        "F1 Score": 0.8985879332477535
    },
    {
        "ID": 6,
        "Video IDs": [
            329,
            118,
            283,
            187,
            147,
            163,
            70,
            159,
            293,
            240,
            308,
            325,
            69,
            5,
            153,
            174,
            108,
            254,
            75,
            71,
            280,
            119,
            134,
            211,
            89,
            8,
            178,
            112,
            168,
            24
        ],
        "Model Output": [
            "N\n\nThe person in the frames appears to be walking around the room and does not show any signs of falling. They maintain an upright posture and continue moving without any indication of losing balance or collapsing.",
            "N\n\nThe person in the images does not appear to have fallen. They are seen moving from a seated position at the table to standing and walking around the room, and then sitting down on the couch. There is no indication of a fall in the sequence of images.",
            "N\n\nThe person in the frames appears to be moving around and possibly dancing or performing some other activity, but there is no indication that they have fallen. They remain upright and on their feet throughout the sequence of images.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially walking, then bending forward, and finally lying flat on the ground, indicating a fall.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is seen lying on the floor, indicating that they have fallen from a standing position.",
            "Y\n\nThe person has fallen. In the first three frames, the individual is progressively leaning forward and losing balance. In the final frame, the person is lying flat on the floor, indicating a fall.",
            "N\n\nThe person in the frames is seen sitting, standing, walking, and interacting with objects in the room. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person has fallen. In the first frame, they are standing upright. In the second frame, they are leaning forward and losing balance. In the third frame, they are on the ground, indicating a fall.",
            "N\n\nThe person in the images appears to have knelt down and then returned to a standing position. There is no indication of a fall, as the movements seem controlled and deliberate.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially standing and then progressively moving towards the floor, eventually lying flat on the ground.",
            "N\n\nThe person in the frames appears to be bending down and then standing back up without losing balance or falling to the ground. The sequence shows controlled movements rather than an uncontrolled fall.",
            "N\n\nThe person in the frames is walking around the room and appears to be in control of their movements. There is no indication of a fall in any of the frames.",
            "N\n\nThe person in the frames is consistently seen standing and mopping the floor. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is seen lying on the mattress on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then begins to lean forward and lose balance, and finally ends up lying on the floor.",
            "Y\n\nThe person appears to have fallen as they are seen transitioning from an upright position to being on the ground in the second frame.",
            "N\n\nThe person in the frames is seen standing, walking towards a stool, and then sitting down on it. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially standing and then gradually moves towards the floor, ending up lying prone on the ground.",
            "Y\n\nThe person has fallen. In the initial frames, the person is seated on the couch. As the sequence progresses, the person leans forward and then appears to lose balance, resulting in them lying on the floor in the later frames.",
            "Y\n\nThe person is lying on the floor in the last few frames, indicating that they have fallen.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then begins to lean forward, and eventually ends up lying on the floor, indicating a fall.",
            "N\n\nThe person in the frames does not appear to have fallen. They are seen sitting on the couch, standing up, and walking around the room without any indication of a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing, then begins to lose balance, and finally is seen lying on the ground next to a chair.",
            "N\n\nThe person in the frames appears to be intentionally sitting down on the couch rather than falling. The sequence shows a controlled movement towards the couch, bending down, and then sitting.",
            "Y\n\nThe person has fallen. In the initial frames, the person is sitting at the table. As the sequence progresses, the person begins to lean forward and loses balance. In the last two frames, the person is lying on the floor, indicating a fall.",
            "Y\n\nThe person is seen standing and then bending over in the initial frames. In the later frames, the person is lying on the mattress on the floor, indicating that they have fallen.",
            "Y\n\nThe person appears to have fallen as they are no longer seated in the chair and are now on the floor with their hands and knees making contact with the ground.",
            "N\n\nThe person in the frames is seen walking towards a stool and then sitting down on it. There is no indication of a fall; the person appears to be in control and seated comfortably.",
            "Y\n\nThe person is lying on the floor in the third and fourth frames, indicating that they have fallen.",
            "Y\n\nThe person has fallen as evidenced by the final frames where they are lying flat on the mattress on the floor."
        ],
        "Model Predictions": [
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y"
        ],
        "Ground Truth": [
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y"
        ],
        "True Positive Count": 18,
        "True Negative Count": 12,
        "False Positive Count": 0,
        "False Negative Count": 0,
        "Precision": 1.0,
        "Recall": 1.0,
        "F1 Score": 1.0
    },
    {
        "ID": 7,
        "Video IDs": [
            157,
            252,
            233,
            159,
            71,
            109,
            138,
            128,
            43,
            303,
            124,
            248,
            296,
            161,
            267,
            325,
            226,
            227,
            287,
            8,
            193,
            61,
            189,
            97,
            302,
            103,
            77,
            59,
            86,
            96
        ],
        "Model Output": [
            "Y\n\nThe person appears to have fallen as they are seen moving from a seated position to a position where they are bent over with their hands reaching towards the floor, indicating a loss of balance or control.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to sitting on the floor, then lying down, and finally remaining on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the first frame, they are standing upright. In the second frame, they are leaning forward significantly, indicating a loss of balance. In the third frame, they are on the ground, confirming the fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is sitting at the table, then stands up and moves towards the mat. In the later frames, the person is seen lying on the mat in a position that suggests they have fallen.",
            "N\n\nThe person in the series of images appears to be moving around the room and then sitting down on the couch. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person appears to have fallen. In the first frame, they are seated on a chair. In the second frame, they are in the process of falling off the chair. In the third and fourth frames, they are lying on the ground, indicating that they have fallen.",
            "N\n\nThe person in the images is seen sitting at a table, then standing up, walking around the room, and finally sitting on a couch. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person is lying on the mattress on the floor in the last few frames, indicating that they have fallen.",
            "N\n\nThe person in the images appears to be bending down to pick up an object from the floor. There is no indication of a fall, as the person maintains control and stands back up after retrieving the object.",
            "N\n\nThe person in the frames appears to be moving from a seated position at the table to a standing position, walking across the room, and then sitting down on the couch. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and walking, then is seen descending towards the floor, and finally lying flat on the ground, indicating a fall.",
            "N\n\nThe person in the frames appears to be kneeling or crouching down intentionally rather than falling. There is no indication of a sudden loss of balance or an uncontrolled descent to the ground.",
            "N\n\nThe person appears to be bending forward, possibly to pick something up or to adjust their position, but there is no indication that they have fallen.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing, then is seen descending towards the floor, and finally lying flat on the ground, indicating a fall.",
            "N\n\nThe person in the series of images appears to be walking around the room without any indication of falling. The individual maintains an upright posture and does not show any signs of losing balance or collapsing.",
            "N\n\nThe person in the images appears to be intentionally sitting down on the bed and then lying down. There are no signs of an accidental fall.",
            "N\n\nThe person in the images appears to be intentionally sitting down on the bed and then lying down, rather than falling. The movements are controlled and deliberate, indicating that they are not falling but rather positioning themselves to rest on the bed.",
            "N\n\nThe person in the frames appears to be moving around the room, possibly dancing or exercising. There is no indication of a fall in any of the frames. The person maintains an upright position throughout the sequence.",
            "Y\n\nThe person is seen lying on the mattress in the last few frames, indicating that they have fallen.",
            "N\n\nThe person in the frames appears to be bending down intentionally, possibly to pick something up or look at something on the lower shelves. There is no indication of a fall, as the movements seem controlled and deliberate.",
            "N\n\nThe person in the images is seen walking around, standing, and sitting down on a chair. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person has fallen. In the first frame, the person is seated on a chair. In the second frame, the person is in the process of standing up or bending down. In the third frame, the person is lying on the floor, indicating that they have fallen.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is lying on the floor, indicating that they have fallen from their previous standing position.",
            "N\n\nThe person in the images is bending down to pick up an object from the floor and then stands back up. There is no indication of a fall.",
            "Y\n\nThe person appears to have fallen. In the sixth frame, the individual is seen losing balance, and in the seventh and eighth frames, they are lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen walking towards a stool, bending over, and then losing balance, resulting in a fall onto the mat on the floor. The final frames show the person lying on the mat, indicating a fall.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is lying on the mattress on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the initial frames, the person is seated upright at the table. As the sequence progresses, the person leans forward and eventually ends up on the floor, indicating a fall.",
            "Y\n\nThe person is seen in the final frames lying on the floor, indicating that they have fallen."
        ],
        "Model Predictions": [
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "N",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y"
        ],
        "Ground Truth": [
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y"
        ],
        "True Positive Count": 17,
        "True Negative Count": 12,
        "False Positive Count": 0,
        "False Negative Count": 1,
        "Precision": 0.9692307692307692,
        "Recall": 0.9666666666666667,
        "F1 Score": 0.9668571428571427
    },
    {
        "ID": 8,
        "Video IDs": [
            237,
            282,
            8,
            191,
            307,
            71,
            252,
            257,
            39,
            118,
            313,
            105,
            262,
            53,
            126,
            16,
            4,
            6,
            94,
            54,
            22,
            204,
            227,
            21,
            173,
            46,
            91,
            19,
            109,
            244
        ],
        "Model Output": [
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially standing and then progressively moving towards the floor, eventually lying flat on their back, indicating a fall.",
            "N\n\nThe person in the frames is standing and moving around the room, but there is no indication that they have fallen. They remain upright and appear to be in control of their movements throughout the sequence of images.",
            "Y\n\nThe person is lying on the mattress in the last few frames, indicating that they have fallen.",
            "N\n\nThe person in the frames appears to be bending down, possibly to pick something up or to sit on the chair. There is no indication of a fall.",
            "N\n\nThe person in the images appears to be bending down to pick something up from the floor and then stands back up without any indication of falling.",
            "Y\n\nThe person is lying on the floor in the last few frames, indicating that they have fallen.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially standing and then progressively moves towards the ground, ending up lying on the floor.",
            "Y\n\nThe person appears to have fallen. In the third frame, the individual is seen losing balance and starting to fall. By the fourth frame, the person is lying face down on the mattress, indicating that they have fallen and are not in an upright position. The subsequent frames show the person remaining in the same position, confirming the fall.",
            "N\n\nThe person in the images does not appear to have fallen. They are seen moving from a seated position at the table to standing and walking around the room, and then sitting down on the couch. There is no indication of a fall in the sequence of images.",
            "N\n\nThe person has not fallen. They are seated on a chair throughout the series of images, although they do change their posture and lean forward at times.",
            "Y\n\nThe person appears to have fallen. In the last three frames, the individual is lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is standing and then appears to be in the process of falling. In the subsequent frames, the person is lying on the floor, indicating that they have fallen.",
            "N\n\nThe person in the images appears to have intentionally laid down on the mattress on the floor. There is no indication of a fall, as the movements seem controlled and deliberate.",
            "N\n\nThe person in the frames appears to be moving around the room and interacting with objects without any indication of falling. They are seen sitting on the couch, standing up, walking, and then sitting at the table. There is no evidence of a fall in any of the frames.",
            "Y\n\nThe person appears to have fallen. In the third frame, the person is seen falling forward, and in the subsequent frames, they are lying face down on the floor, indicating that they have not gotten up.",
            "N\n\nThe person has not fallen. They appear to have intentionally laid down on the mattress placed on the floor. The sequence of movements shows a controlled descent to the mattress, indicating a deliberate action rather than an accidental fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is walking around the room. In the later frames, the person is seen on the floor, lying on a mattress, indicating a fall.",
            "Y\n\nThe person has fallen. In the last two frames, the individual is lying on the floor, indicating that they have fallen from their previous standing position.",
            "Y\n\nThe person is seen walking and then lying on the floor in the last few frames, indicating that they have fallen.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated, then stands up, and subsequently loses balance, falling forward onto a mattress on the floor. The final frames show the person lying on the mattress, indicating a fall.",
            "N\n\nThe person in the frames appears to be bending down and then standing back up, rather than falling. The sequence shows controlled movements without any indication of a loss of balance or an uncontrolled descent to the ground.",
            "N\n\nThe person in the images appears to be intentionally sitting down on the bed and then lying down, rather than falling. The movements are controlled and deliberate, indicating that the person has not fallen.",
            "N\n\nThe person appears to have intentionally laid down on the mattress placed on the floor. The sequence of movements suggests a deliberate action rather than an accidental fall.",
            "Y\n\nThe person appears to have fallen as they are no longer seated on the chair and are instead on the floor in the second frame.",
            "Y\n\nThe person has fallen. In the initial frames, the person is standing and moving around the room. In the later frames, the person is seen on all fours and then lying face down on the mattress, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is sitting at the table, then they begin to lean forward and eventually fall to the floor, where they remain lying down in the final frames.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen losing balance and falling backward onto a mattress on the floor, eventually lying down completely.",
            "N\n\nThe person in the images is seen moving from a seated position at the table to the couch. They appear to be walking steadily and then sitting down on the couch without any indication of falling.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on all fours, and then to lying face down on the floor, indicating a fall."
        ],
        "Model Predictions": [
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y"
        ],
        "Ground Truth": [
            "Y",
            "N",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y"
        ],
        "True Positive Count": 18,
        "True Negative Count": 9,
        "False Positive Count": 0,
        "False Negative Count": 3,
        "Precision": 0.925,
        "Recall": 0.9,
        "F1 Score": 0.9032967032967034
    },
    {
        "ID": 9,
        "Video IDs": [
            287,
            243,
            303,
            182,
            247,
            230,
            202,
            113,
            216,
            70,
            242,
            192,
            277,
            19,
            162,
            34,
            323,
            11,
            6,
            91,
            314,
            222,
            100,
            50,
            225,
            102,
            60,
            238,
            244,
            115
        ],
        "Model Output": [
            "N\n\nThe person in the frames appears to be moving around actively, but there is no indication that they have fallen. They remain upright and continue their movements throughout the sequence of images.",
            "Y\n\nThe person has fallen. The sequence of images shows the individual initially standing and then progressively moving towards the floor, ultimately lying down on the ground.",
            "N\n\nThe person in the images is bending down to pick up an object from the floor and then stands back up. There is no indication of a fall.",
            "Y\n\nThe person appears to have fallen as they are seen in a prone position on the floor in the second frame, indicating a loss of balance or control.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on their hands and knees, and then to lying flat on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen progressively moving from an upright position to a crouched position, and finally lying on the floor, indicating a fall.",
            "N\n\nThe person in the frames appears to be bending down and then standing back up, but there is no indication that they have fallen. The sequence shows controlled movements without any signs of a fall.",
            "N\n\nThe person in the images is seen walking towards a stool, then sitting down on it. There is no indication of a fall; the person appears to have intentionally sat down on the stool.",
            "N\n\nThe person has not fallen. In the sequence of images, the individual appears to be bending down and then standing back up, rather than falling.",
            "N\n\nThe person in the frames does not appear to have fallen. They are seen sitting, standing, walking, and interacting with objects in the room without any indication of losing balance or falling to the ground.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing, then crouching, and finally lying flat on the floor, indicating a fall.",
            "N\n\nThe person in the frames appears to be bending down intentionally, possibly to pick something up from the floor. There is no indication of a fall, as the movements seem controlled and deliberate.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then begins to lose balance, and ultimately ends up lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is seen losing balance and falling backward onto a mattress on the floor. The final frames show the person lying on the mattress, indicating that they have fallen.",
            "Y\n\nThe person appears to have fallen as they are seen moving from an upright position in the first frame to a position on the floor in the second frame.",
            "N\n\nThe person has not fallen. In the final frames, the person is seen lying down on the mattress intentionally, suggesting a deliberate action rather than an accidental fall.",
            "N\n\nThe person in the images appears to be walking around the room and standing in various positions. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person is seen bending forward and then lying face down on the mattress, indicating that they have fallen.",
            "Y\n\nThe person has fallen. In the initial frames, the person is walking normally. However, in the later frames, the person is seen on the floor, lying on a mattress, indicating a fall.",
            "Y\n\nThe person has fallen. In the initial frames, the person is seated at the table. As the sequence progresses, the person begins to lean forward and eventually collapses onto the mat on the floor, where they remain lying down in the final frames.",
            "N\n\nThe person in the series of images has not fallen. They are seen moving a chair, positioning it, and then sitting down on it. There is no indication of a fall in any of the frames.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to bending over, then to being on their hands and knees, and finally lying on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the last two frames, they are lying on the floor next to the couch, indicating that they have fallen from an upright position.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is seen lying flat on the floor, indicating a fall.",
            "N\n\nThe person in the frames appears to be bending down and then getting back up without any indication of losing balance or falling. The sequence shows controlled movements rather than an accidental fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated at a table, then begins to stand up, and subsequently loses balance, resulting in them lying on the floor in the final frames.",
            "Y\n\nThe person is lying on the floor in the last few frames, indicating that they have fallen.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual transitions from walking upright to being on the floor, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on all fours, and then to lying face down on the floor, indicating a fall. The person remains in a prone position, suggesting they have not gotten up after the fall.",
            "N\n\nThe person in the images is seen moving from a seated position at the table to walking across the room and then sitting down on the couch. There is no indication of a fall in any of the frames. The movements appear controlled and deliberate."
        ],
        "Model Predictions": [
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N"
        ],
        "Ground Truth": [
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "N",
            "N",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N"
        ],
        "True Positive Count": 16,
        "True Negative Count": 11,
        "False Positive Count": 2,
        "False Negative Count": 1,
        "Precision": 0.9009259259259259,
        "Recall": 0.9,
        "F1 Score": 0.8994285714285714
    },
    {
        "ID": 10,
        "Video IDs": [
            31,
            202,
            257,
            173,
            153,
            158,
            216,
            221,
            184,
            233,
            295,
            124,
            300,
            133,
            73,
            49,
            41,
            140,
            299,
            214,
            195,
            163,
            274,
            203,
            57,
            76,
            267,
            54,
            208,
            160
        ],
        "Model Output": [
            "Y\n\nThe person has fallen. In the last few frames, the individual is lying on the mattress on the floor, indicating a fall.",
            "N\n\nThe person in the images appears to be kneeling down and then standing back up, rather than falling. The sequence shows controlled movements without any signs of an accidental fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and then is seen descending towards the floor, ultimately lying flat on the ground.",
            "Y\n\nThe person appears to have fallen as they are no longer seated on the chair and are instead on the floor in the second frame.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated, then begins to lose balance, and finally ends up lying on the floor.",
            "Y\n\nThe person appears to have fallen as they are no longer in an upright seated position and are instead leaning forward with their body on the floor.",
            "N\n\nThe person appears to be bending down intentionally, possibly to pick something up, and then stands back up. There is no indication of a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing upright to being on their hands and knees, and then lying prone on the floor, which indicates a fall.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from an upright position to lying flat on the ground, indicating a fall.",
            "Y\n\nThe person appears to have fallen. In the initial frames, they are standing and then gradually move towards the floor, ending up lying down in the subsequent frames.",
            "N\n\nThe person in the images appears to be kneeling down intentionally rather than falling. The sequence shows a controlled movement to the ground and then back up, indicating that the person did not fall.",
            "N\n\nThe person in the frames appears to be moving around the room and eventually sits down on the couch. There is no indication of a fall in any of the frames. The movements seem controlled and intentional.",
            "N\n\nThe person in the images appears to be bending down and then getting back up, possibly to pick something up from the floor. There is no indication of a fall, as the movements seem controlled and intentional.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual transitions from sitting on a chair to being on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated at a table, then stands up, and subsequently loses balance, resulting in them lying on the floor.",
            "Y\n\nThe person has fallen. In the 18th frame, the person is seen losing balance and starting to fall. By the 19th frame, the person is on the mattress, indicating a fall.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is seen lying on the mattress on the floor, indicating a fall.",
            "Y\n\nThe person is lying on the floor in the final frame, indicating that they have fallen.",
            "N\n\nThe person appears to be kneeling down intentionally rather than falling. The sequence of movements suggests a controlled descent to the knees rather than an accidental fall.",
            "N\n\nThe person in the images appears to be kneeling down and then standing back up, rather than falling. The sequence shows a controlled movement to the ground and then a return to a standing position.",
            "N\n\nThe person in the frames is bending down and appears to be picking something up from the floor. There is no indication of a fall; the person maintains balance and control throughout the sequence.",
            "Y\n\nThe person has fallen. In the first three frames, the person is progressively leaning forward and losing balance. In the final frame, the person is lying flat on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sequence of images, the individual is initially seated on a chair, then leans forward, and eventually ends up lying on the floor, indicating a fall.",
            "N\n\nThe person appears to be bending down and then standing back up, rather than falling. The sequence of movements does not indicate a loss of balance or an uncontrolled descent to the ground.",
            "Y\n\nThe person has fallen. In the last few frames, the individual is seen lying on the mattress on the floor, indicating a fall.",
            "Y\n\nThe person has fallen. In the sixth frame, the person is seen losing balance and falling backward. In the seventh and eighth frames, the person is lying on the floor, indicating that they have fallen.",
            "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing, then is seen descending towards the floor, and finally lying flat on the ground, indicating a fall.",
            "Y\n\nThe person is seen walking and then is shown lying on the floor in the last few frames, indicating that they have fallen.",
            "N\n\nThe person in the frames appears to be sitting down on the couch rather than falling. The sequence shows a controlled movement towards the couch, ending in a seated position.",
            "Y\n\nThe person is lying on the floor in the third frame, indicating that they have fallen."
        ],
        "Model Predictions": [
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y"
        ],
        "Ground Truth": [
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "N",
            "N",
            "Y",
            "Y",
            "N",
            "Y",
            "Y",
            "Y",
            "Y",
            "N",
            "Y"
        ],
        "True Positive Count": 19,
        "True Negative Count": 10,
        "False Positive Count": 1,
        "False Negative Count": 0,
        "Precision": 0.9683333333333334,
        "Recall": 0.9666666666666667,
        "F1 Score": 0.9663003663003662
    },
    {
        "id": "Failure Cases",
        "failure_cases": [
            {
                "batch_id": 1,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing upright to bending over, and then to being on the floor, indicating a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 223,
                "video_path": "./data/Videos/video_(223).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0
                ]
            },
            {
                "batch_id": 2,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person has not fallen. They appear to have intentionally laid down on the mattress placed on the floor. The sequence of movements suggests a deliberate action rather than an accidental fall.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 45,
                "video_path": "./data/Videos/video_(45).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175,
                    200
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0
                ]
            },
            {
                "batch_id": 2,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is initially standing and walking, but then they are seen sitting on the couch and eventually lying down with their legs up, indicating a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 213,
                "video_path": "./data/Videos/video_(213).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180,
                    210
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0
                ]
            },
            {
                "batch_id": 2,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person is lying on the floor in the last few frames, indicating that they have fallen.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 52,
                "video_path": "./data/Videos/video_(52).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175,
                    200
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0
                ]
            },
            {
                "batch_id": 2,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person appears to be bending forward, possibly to pick something up or to perform an action, but there is no indication that they have fallen.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 161,
                "video_path": "./data/Videos/video_(161).avi",
                "frame_numbers": [
                    0,
                    30
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0
                ]
            },
            {
                "batch_id": 3,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual is seen walking, then bending down, and eventually ending up on the floor with their legs elevated, indicating a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 212,
                "video_path": "./data/Videos/video_(212).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180,
                    210
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0
                ]
            },
            {
                "batch_id": 3,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to a position on the floor, indicating a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 224,
                "video_path": "./data/Videos/video_(224).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0
                ]
            },
            {
                "batch_id": 4,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to a crouched position, then to kneeling, and finally to a position on the floor, indicating a loss of balance or control.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 298,
                "video_path": "./data/Videos/video_(298).avi",
                "frame_numbers": [
                    0,
                    20,
                    40,
                    60,
                    80,
                    100,
                    120,
                    140,
                    160,
                    180,
                    200,
                    220,
                    240
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0,
                    9.0,
                    10.0,
                    11.0,
                    12.0
                ]
            },
            {
                "batch_id": 4,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person has not fallen. They appear to have intentionally laid down on the mattress placed on the floor. The sequence of movements suggests a deliberate action rather than an accidental fall.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 4,
                "video_path": "./data/Videos/video_(4).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175,
                    200
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0
                ]
            },
            {
                "batch_id": 4,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person in the images appears to be bending over, not falling. The position and posture suggest intentional movement rather than an accidental fall.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 172,
                "video_path": "./data/Videos/video_(172).avi",
                "frame_numbers": [
                    0,
                    30
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0
                ]
            },
            {
                "batch_id": 5,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person is seen standing and walking in the earlier frames, but in the later frames, they are lying on the floor in a position that suggests they have fallen.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 52,
                "video_path": "./data/Videos/video_(52).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175,
                    200
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0
                ]
            },
            {
                "batch_id": 5,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to being on all fours and then lying on the ground, indicating a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 224,
                "video_path": "./data/Videos/video_(224).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0
                ]
            },
            {
                "batch_id": 5,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person in the frames appears to be bending over or moving downward, but there is no clear indication that they have fallen. The person is still in an upright position, and there is no evidence of a fall.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 172,
                "video_path": "./data/Videos/video_(172).avi",
                "frame_numbers": [
                    0,
                    30
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0
                ]
            },
            {
                "batch_id": 7,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person appears to be bending forward, possibly to pick something up or to adjust their position, but there is no indication that they have fallen.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 161,
                "video_path": "./data/Videos/video_(161).avi",
                "frame_numbers": [
                    0,
                    30
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0
                ]
            },
            {
                "batch_id": 8,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person in the images appears to have intentionally laid down on the mattress on the floor. There is no indication of a fall, as the movements seem controlled and deliberate.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 53,
                "video_path": "./data/Videos/video_(53).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175,
                    200,
                    225,
                    250,
                    275,
                    300,
                    325,
                    350,
                    375
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0,
                    9.0,
                    10.0,
                    11.0,
                    12.0,
                    13.0,
                    14.0,
                    15.0
                ]
            },
            {
                "batch_id": 8,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person has not fallen. They appear to have intentionally laid down on the mattress placed on the floor. The sequence of movements shows a controlled descent to the mattress, indicating a deliberate action rather than an accidental fall.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 4,
                "video_path": "./data/Videos/video_(4).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175,
                    200
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0
                ]
            },
            {
                "batch_id": 8,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person appears to have intentionally laid down on the mattress placed on the floor. The sequence of movements suggests a deliberate action rather than an accidental fall.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 21,
                "video_path": "./data/Videos/video_(21).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0
                ]
            },
            {
                "batch_id": 9,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person has fallen. In the sequence of images, the individual is seen progressively moving from an upright position to a crouched position, and finally lying on the floor, indicating a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 230,
                "video_path": "./data/Videos/video_(230).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180,
                    210,
                    240,
                    270,
                    300
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0,
                    9.0,
                    10.0
                ]
            },
            {
                "batch_id": 9,
                "ground_truth": "Y",
                "model_output": "N\n\nThe person has not fallen. In the final frames, the person is seen lying down on the mattress intentionally, suggesting a deliberate action rather than an accidental fall.",
                "model_prediction": "N",
                "false_positive": false,
                "false_negative": false,
                "video_number": 34,
                "video_path": "./data/Videos/video_(34).avi",
                "frame_numbers": [
                    0,
                    25,
                    50,
                    75,
                    100,
                    125,
                    150,
                    175,
                    200,
                    225,
                    250,
                    275,
                    300,
                    325,
                    350,
                    375,
                    400
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0,
                    9.0,
                    10.0,
                    11.0,
                    12.0,
                    13.0,
                    14.0,
                    15.0,
                    16.0
                ]
            },
            {
                "batch_id": 9,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing to bending over, then to being on their hands and knees, and finally lying on the floor, indicating a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 222,
                "video_path": "./data/Videos/video_(222).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0
                ]
            },
            {
                "batch_id": 10,
                "ground_truth": "N",
                "model_output": "Y\n\nThe person appears to have fallen. In the sequence of images, the individual transitions from standing upright to being on their hands and knees, and then lying prone on the floor, which indicates a fall.",
                "model_prediction": "Y",
                "false_positive": true,
                "false_negative": true,
                "video_number": 221,
                "video_path": "./data/Videos/video_(221).avi",
                "frame_numbers": [
                    0,
                    30,
                    60,
                    90,
                    120,
                    150,
                    180,
                    210,
                    240
                ],
                "time_of_frames(seconds)": [
                    0.0,
                    1.0,
                    2.0,
                    3.0,
                    4.0,
                    5.0,
                    6.0,
                    7.0,
                    8.0
                ]
            }
        ]
    },
    {
        "id": "Final Evaluation",
        "Total True Positive": 182,
        "Total True Negative": 97,
        "Total False Positive": 11,
        "Total False Negative": 10,
        "Precision (Mean)": 0.9341671909961383,
        "Precision (Standard Deviation)": 0.041833571013279655,
        "Recall (Mean)": 0.93,
        "Recall (Standard Deviation)": 0.04288946459026395,
        "F1 Score (Mean)": 0.9299642176876466,
        "F1 Score (Standard Deviation)": 0.042605429543619046
    }
]